#include <stdio.h>
#define _CRT_SECURE_NO_WARNINGS

/*int main(){
    int i = 0;
    int n = 0;
    printf("êµ¬êµ¬?ï¿½ï¿½?ï¿½ï¿½ ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½: ");
    scanf("%d",&n);
    while (i<9){
        i++;
        printf("%d * %d = %d\n",n,i,n*i);
    }
}*/

/*int main(){
    int score = 0;
    double sum = 0, average = 0;
    printf("?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ì¢…ë£Œ?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½.\n");
    while(score>=0){
        average++;
        printf("?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ì£¼ì„¸?ï¿½ï¿½: ");
        scanf("%d",&score);
        sum += score;
    }
    printf("?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ %.1lf?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½.",sum/average);
}*/

/*int main(){ 
    int sum = 0;
    int num ;
    do{
        printf("?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½: ");
        scanf("%d",&num);
        sum += num;
    }while(num != 0);
    printf("?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ ?ï¿½ï¿½: %d\n",sum);
    return 0;
}*/

/*int main(){
    int i,sum;
    printf("1ï¿???ï¿½ï¿½ 10ê¹Œï¿½???ï¿½ï¿½ ?ï¿½ï¿½?ï¿½ï¿½ êµ¬í•©?ï¿½ï¿½?ï¿½ï¿½.\n");
    for(i=1;i<=10;i++){
        sum += i;
    }
    printf("1ï¿???ï¿½ï¿½ 10ê¹Œï¿½???ï¿½ï¿½ ?ï¿½ï¿½??? %d?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½.\n",sum);
}*/

/* int main(){
    int n,factorial;
    printf("?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½: ");
    scanf("%d",&n);
    for(int i=1;i<=n;i++){
        factorial *= i;
    }
    printf("%d! = %d\n",n,factorial);
} */

/*int main(){
    int n,sum=0;
    char c;
    while(1){
        printf("?ï¿½ï¿½?ï¿½ï¿½ï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½: ");
        scanf("%d",&n);        
        printf("ê³„ì†?ï¿½ï¿½?ï¿½ï¿½ê² ìŠµ?ï¿½ï¿½ï¿???(y/n): ");
        scanf("%c",&c);
        sum += n;
        if(c == 'n'){
            break;
        }
    }
    printf("?ï¿½ï¿½ï¿??: %d\n",sum);
} */

/* int main(){
    char ch;
    char letter;
    while(1){
        printf("ë¬¸ìï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½: (?ï¿½ï¿½ë¬¸ìï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½, ì¢…ë£Œ?ï¿½ï¿½?ï¿½ï¿½ï¿?? Qï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½))");
        scanf("%c",&letter);
        ch = letter-32;
        if(letter == 'Q')
            break;
        if ( letter <'a' || letter > 'z')
            printf("???ë¬¸ìï¿?? ï¿???ï¿½ï¿½: %c",ch);
    }
} */

int main(){
    char i;
    while(1){
        printf("ë¬¸ìï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½: (?ï¿½ï¿½ë¬¸ìï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½, ì¢…ë£Œ?ï¿½ï¿½?ï¿½ï¿½ï¿?? Qï¿?? ?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½ì£¼ì„¸?ï¿½ï¿½))");
    }
}